In [3]:
import numpy as np
import pandas as pd

In [9]:
df=pd.DataFrame(np.random.randn(5,4), index=['n','c', 'e','f','h'],columns=['one','two','three','four'])

In [5]:
df.head()

        one       two     three
a -1.046269 -0.726505  0.154890
c  0.296159  0.733878 -0.889744
e  0.607740 -0.235081 -2.012491
f  0.176152 -0.193845 -1.664899
h -0.181890 -0.219888 -2.145028

In [10]:
df2=df.reindex(['a','b','c','d','e','f','g','h'])

In [11]:
df2

        one       two     three      four
a       NaN       NaN       NaN       NaN
b       NaN       NaN       NaN       NaN
c  1.168576  1.505982 -0.556439  0.629923
d       NaN       NaN       NaN       NaN
e  1.180740 -0.769806 -0.394134  0.720078
f -0.661842 -0.156529  1.604085  0.450857
g       NaN       NaN       NaN       NaN
h  1.151512  0.169266  0.039403 -1.147513

In [13]:
df2.dropna(axis=0)

        one       two     three      four
c  1.168576  1.505982 -0.556439  0.629923
e  1.180740 -0.769806 -0.394134  0.720078
f -0.661842 -0.156529  1.604085  0.450857
h  1.151512  0.169266  0.039403 -1.147513

In [14]:
pd.isna(df2['one'])

a     True
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [15]:
df2['one'].notna()

a    False
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [16]:
df2.fillna('missing')

        one       two      three      four
a   missing   missing    missing   missing
b   missing   missing    missing   missing
c   1.16858   1.50598  -0.556439  0.629923
d   missing   missing    missing   missing
e   1.18074 -0.769806  -0.394134  0.720078
f -0.661842 -0.156529    1.60409  0.450857
g   missing   missing    missing   missing
h   1.15151  0.169266  0.0394035  -1.14751

In [17]:
df2['one'].values

array([        nan,         nan,  1.16857587,         nan,  1.18073976,
       -0.6618419 ,         nan,  1.15151152])